#pragma once

#include <algorithm>
#include <expected>
#include <map>
#include <string>

/**
 * @brief 主要エリアの定義
 * 情報源: https://weather.tsukumijima.net/primary_area.xml
 * 地図上の地名 (JP or EN) -> 地域コード
 */

// 日本語の地名 -> 地域コード
const std::map<std::string, std::string> city_code_by_jp = {
    {"稚内", "011000"},     {"旭川", "012010"},   {"留萌", "012020"},
    {"網走", "013010"},     {"北見", "013020"},   {"紋別", "013030"},
    {"根室", "014010"},     {"釧路", "014020"},   {"帯広", "014030"},
    {"室蘭", "015010"},     {"浦河", "015020"},   {"札幌", "016010"},
    {"岩見沢", "016020"},   {"倶知安", "016030"}, {"函館", "017010"},
    {"江差", "017020"},     {"青森", "020010"},   {"むつ", "020020"},
    {"八戸", "020030"},     {"盛岡", "030010"},   {"宮古", "030020"},
    {"大船渡", "030030"},   {"仙台", "040010"},   {"白石", "040020"},
    {"秋田", "050010"},     {"横手", "050020"},   {"山形", "060010"},
    {"米沢", "060020"},     {"酒田", "060030"},   {"新庄", "060040"},
    {"福島", "070010"},     {"小名浜", "070020"}, {"若松", "070030"},
    {"水戸", "080010"},     {"土浦", "080020"},   {"宇都宮", "090010"},
    {"大田原", "090020"},   {"前橋", "100010"},   {"みなかみ", "100020"},
    {"さいたま", "110010"}, {"熊谷", "110020"},   {"秩父", "110030"},
    {"千葉", "120010"},     {"銚子", "120020"},   {"館山", "120030"},
    {"東京", "130010"},     {"大島", "130020"},   {"八丈島", "130030"},
    {"父島", "130040"},     {"横浜", "140010"},   {"小田原", "140020"},
    {"新潟", "150010"},     {"長岡", "150020"},   {"高田", "150030"},
    {"相川", "150040"},     {"富山", "160010"},   {"伏木", "160020"},
    {"金沢", "170010"},     {"輪島", "170020"},   {"福井", "180010"},
    {"敦賀", "180020"},     {"甲府", "190010"},   {"河口湖", "190020"},
    {"長野", "200010"},     {"松本", "200020"},   {"飯田", "200030"},
    {"岐阜", "210010"},     {"高山", "210020"},   {"静岡", "220010"},
    {"網代", "220020"},     {"三島", "220030"},   {"浜松", "220040"},
    {"名古屋", "230010"},   {"豊橋", "230020"},   {"津", "240010"},
    {"尾鷲", "240020"},     {"大津", "250010"},   {"彦根", "250020"},
    {"京都", "260010"},     {"舞鶴", "260020"},   {"大阪", "270000"},
    {"神戸", "280010"},     {"豊岡", "280020"},   {"奈良", "290010"},
    {"風屋", "290020"},     {"和歌山", "300010"}, {"潮岬", "300020"},
    {"鳥取", "310010"},     {"米子", "310020"},   {"松江", "320010"},
    {"浜田", "320020"},     {"西郷", "320030"},   {"岡山", "330010"},
    {"津山", "330020"},     {"広島", "340010"},   {"庄原", "340020"},
    {"下関", "350010"},     {"山口", "350020"},   {"柳井", "350030"},
    {"萩", "350040"},       {"徳島", "360010"},   {"日和佐", "360020"},
    {"高松", "370000"},     {"松山", "380010"},   {"新居浜", "380020"},
    {"宇和島", "380030"},   {"高知", "390010"},   {"室戸岬", "390020"},
    {"清水", "390030"},     {"福岡", "400010"},   {"八幡", "400020"},
    {"飯塚", "400030"},     {"久留米", "400040"}, {"佐賀", "410010"},
    {"伊万里", "410020"},   {"長崎", "420010"},   {"佐世保", "420020"},
    {"厳原", "420030"},     {"福江", "420040"},   {"熊本", "430010"},
    {"阿蘇乙姫", "430020"}, {"牛深", "430030"},   {"人吉", "430040"},
    {"大分", "440010"},     {"中津", "440020"},   {"日田", "440030"},
    {"佐伯", "440040"},     {"宮崎", "450010"},   {"延岡", "450020"},
    {"都城", "450030"},     {"高千穂", "450040"}, {"鹿児島", "460010"},
    {"鹿屋", "460020"},     {"種子島", "460030"}, {"名瀬", "460040"},
    {"那覇", "471010"},     {"名護", "471020"},   {"久米島", "471030"},
    {"南大東", "472000"},   {"宮古島", "473000"}, {"石垣島", "474010"},
    {"与那国島", "474020"}};

// 英語の地名 -> 地域コード
const std::map<std::string, std::string> city_code_by_en = {
    {"wakkanai", "011000"},     {"asahikawa", "012010"},
    {"rumoi", "012020"},        {"abashiri", "013010"},
    {"kitami", "013020"},       {"mombetsu", "013030"},
    {"nemuro", "014010"},       {"kushiro", "014020"},
    {"obihiro", "014030"},      {"muroran", "015010"},
    {"urakawa", "015020"},      {"sapporo", "016010"},
    {"iwamizawa", "016020"},    {"kutchan", "016030"},
    {"hakodate", "017010"},     {"esashi", "017020"},
    {"aomori", "020010"},       {"mutsu", "020020"},
    {"hachinohe", "020030"},    {"morioka", "030010"},
    {"miyako", "030020"},       {"ofunato", "030030"},
    {"sendai", "040010"},       {"shiroishi", "040020"},
    {"akita", "050010"},        {"yokote", "050020"},
    {"yamagata", "060010"},     {"yonezawa", "060020"},
    {"sakata", "060030"},       {"shinjo", "060040"},
    {"fukushima", "070010"},    {"onahama", "070020"},
    {"wakamatsu", "070030"},    {"mito", "080010"},
    {"tsuchiura", "080020"},    {"utsunomiya", "090010"},
    {"otawara", "090020"},      {"maebashi", "100010"},
    {"minakami", "100020"},     {"saitama", "110010"},
    {"kumagaya", "110020"},     {"chichibu", "110030"},
    {"chiba", "120010"},        {"choshi", "120020"},
    {"tateyama", "120030"},     {"tokyo", "130010"},
    {"oshima", "130020"},       {"hachijojima", "130030"},
    {"chichijima", "130040"},   {"yokohama", "140010"},
    {"odawara", "140020"},      {"niigata", "150010"},
    {"nagaoka", "150020"},      {"takada", "150030"},
    {"aikawa", "150040"},       {"toyama", "160010"},
    {"fushiki", "160020"},      {"kanazawa", "170010"},
    {"wajima", "170020"},       {"fukui", "180010"},
    {"tsuruga", "180020"},      {"kofu", "190010"},
    {"kawaguchiko", "190020"},  {"nagano", "200010"},
    {"matsumoto", "200020"},    {"iida", "200030"},
    {"gifu", "210010"},         {"takayama", "210020"},
    {"shizuoka", "220010"},     {"ajiro", "220020"},
    {"mishima", "220030"},      {"hamamatsu", "220040"},
    {"nagoya", "230010"},       {"toyohashi", "230020"},
    {"tsu", "240010"},          {"owase", "240020"},
    {"otsu", "250010"},         {"hikone", "250020"},
    {"kyoto", "260010"},        {"maizuru", "260020"},
    {"osaka", "270000"},        {"kobe", "280010"},
    {"toyooka", "280020"},      {"nara", "290010"},
    {"kazeya", "290020"},       {"wakayama", "300010"},
    {"shionomisaki", "300020"}, {"tottori", "310010"},
    {"yonago", "310020"},       {"matsue", "320010"},
    {"hamada", "320020"},       {"saigo", "320030"},
    {"okayama", "330010"},      {"tsuyama", "330020"},
    {"hiroshima", "340010"},    {"shobara", "340020"},
    {"shimonoseki", "350010"},  {"yamaguchi", "350020"},
    {"yanai", "350030"},        {"hagi", "350040"},
    {"tokushima", "360010"},    {"hiwasa", "360020"},
    {"takamatsu", "370000"},    {"matsuyama", "380010"},
    {"niihama", "380020"},      {"uwajima", "380030"},
    {"kochi", "390010"},        {"murotomisaki", "390020"},
    {"shimizu", "390030"},      {"fukuoka", "400010"},
    {"yahata", "400020"},       {"iizuka", "400030"},
    {"kurume", "400040"},       {"saga", "410010"},
    {"imari", "410020"},        {"nagasaki", "420010"},
    {"sasebo", "420020"},       {"izuhara", "420030"},
    {"fukue", "420040"},        {"kumamoto", "430010"},
    {"asootome", "430020"},     {"ushibuka", "430030"},
    {"hitoyoshi", "430040"},    {"oita", "440010"},
    {"nakatsu", "440020"},      {"hita", "440030"},
    {"saiki", "440040"},        {"miyazaki", "450010"},
    {"nobeoka", "450020"},      {"miyakonojo", "450030"},
    {"takachiho", "450040"},    {"kagoshima", "460010"},
    {"kanoya", "460020"},       {"tanegashima", "460030"},
    {"naze", "460040"},         {"naha", "471010"},
    {"nago", "471020"},         {"kumejima", "471030"},
    {"minamidaito", "472000"},  {"miyakojima", "473000"},
    {"ishigakijima", "474010"}, {"yonagunijima", "474020"}};

/**
 * @brief ユーザーの入力に日本語文字が含まれているかどうかを確認する。
 * TODO: 全角スペースのtrim
 */
inline bool isJapanese(const std::string &input) {
  return std::any_of(input.begin(), input.end(),
                     [](unsigned char c) { return c > 127; });
}

/**
 * @brief 正しいmapを自動的に選択し、地域コードを返す。
 * 見つからない場合はunexpected(エラーメッセージ)を返す。
 */
inline std::expected<std::string, std::string>
getCityCode(const std::string &input) {
  if (isJapanese(input)) {
    if (auto it = city_code_by_jp.find(input); it != city_code_by_jp.end()) {
      return it->second;
    }
    return std::unexpected(input + " は有効な地域名ではありません。");
  } else {
    std::string lower_input = input;
    std::transform(lower_input.begin(), lower_input.end(), lower_input.begin(),
                   [](unsigned char c) { return std::tolower(c); });

    if (auto it = city_code_by_en.find(lower_input);
        it != city_code_by_en.end()) {
      return it->second;
    }
    return std::unexpected(input + " は有効な地域名ではありません。");
  }
}

/**
 * @brief 入力が英語か日本語かに関わらず、対応する日本語の地域名を返す。
 */
inline std::string getCityNameJP(const std::string &input, const std::string &code) {
  if (isJapanese(input)) {
    return input;
  } else {
    // auto code_res = getCityCode(input);

    // const std::string& code = *code_res;

    for (const auto& [name, c] : city_code_by_jp) {
        if (c == code) {
            return name;
        } else {
          throw std::runtime_error("変なことが発生してしまいました...");
        }
    }
  }
}